{
    "projects": [
      {        
        "title": "Tienda online con React",
        "subtechtitle": "Tecnologías",
        "description": "Ver tienda en línea usando React (solo en inglés)",
        "description2": "Diseño original en Figma",
        "technologies": " <ul> <li> <p>React</p> </li> <li> <p>HTML5 y CSS3</p></li> <li><p>SASS</p></li><li><p>Tailwind</p></li><li><p>JavaScript</p></li><li><p>React Router</p></li><li><p>Uso de Figma</p></li></ul>",
        "subfunctitle": "Funciones",
        "function1": "<p><b>Página de Detalle de Producto:</b> Al hacer clic en un producto, redirige a una página de detalles, imágenes y opción de agregar al carrito.</p><p><b>Funcionalidad del Carrito:</b> Permite a los usuarios ver los productos que han agregado, así como eliminar artículos del carrito.</p>",
        "function1desc": "Al hacer clic en un producto, redirige a una página de detalles, imágenes y opción de agregar al carrito.",
        "function2": "Funcionalidad del Carrito",
        "function2desc": "Permite a los usuarios ver los productos que han agregado, así como eliminar artículos del carrito.",
        "subchallengesctitle": "Retos",
        "challenges": "Este proyecto es mi primera aplicación React, ya que solo sabía lo básico, es decir, un componente y cómo se mostraba. Me propuse el desafío de aprenderlo de manera más profunda, diseñando una página dinámica con componentes interactivos e incorporando principios de diseño UX/UI para mejorar la experiencia del usuario. Me siento feliz y orgullosa de lo bien que quedó el sitio web y sus funcionalidades."
      },
      {        
        "title": "Enciclopedia de Mascotas",
        "subtechtitle": "Tecnologías",
        "description": "Enciclopedia interactiva de mascotas con API de gatos y perros.",
        "description2": "Código en GitHub", 
        "technologies":  "<ul> <li><p>HTML5 y CSS3</p></li><li><p>Sass</p></li><li><p>JavaScript</p></li><li><p>Rest APIs</p></li><li><p>Diseño responsivo</p></li><li><p>Diseño UX|UI</p></li><li><p>HTML Dinámico </p></li></ul>",
        "subfunctitle":  "Funciones" ,
        "function1": "<ul><li> <p><b>Exploración intuitiva:</b> La web está diseñada para ser amigable a la vista y al usuario para lograr una excelente navegación.</p></li><li><p><b>Favoritos:</b> El usuario tiene la opción de guardar aquellas razas que llaman su atención para consultarlas luego</p></li></ul>",
        "function2": "prueba",
        "function2desc":  "prueba",
        "subchallengesctitle": "Retos",
        "challenges": "Me propuse el reto de intentar hacer una página con solo javascript y conocer un poco sobre conexiones API  como tal nunca habia probado trabajar de esta manera y personalmente lo veía como algo dificil, pero ahora con esto que entiendo lo básico y un poco más me doy cuenta que no era como creía y la verdad aprendí bastante desde la creación, diseño y para mi sorpresa hice esto en pocos días, bastante rápido para ser mi primera vez es un logro y a su vez mi prueba de mi aprendizaje rápido y adaptativo, ahora soy capaz de manejar Rest Api sin ningún problema"
      },
      {        
        "title": "a",
        "subtechtitle": "a" ,
        "description":  "a",
        "description2": "a" , 
        "technologies":   "a",
        "subfunctitle":  "a" ,
        "functions": "a" ,
        "function1desc": "a" ,
        "function2": "a" ,
        "function2desc":  "a" ,
        "subchallengesctitle": "a" ,
        "challenges": "a" 
        }
        ],
        "function1": "Perfil",
        "function1desc": "Presenta una breve introducción personal y profesional sobre mí, incluyendo un resumen de mis estudios y certificaciones.",
        "function2": "Listados de Habilidades",
        "function2desc": "Se presenta un desglose de habilidades técnicas en desarrollo web, entre otras.",
        "challenges": "Mi objetivo era crear una presentación visualmente más atractiva de mis certificados, pero el reto era organizar la información del CV de una manera que fuera atractiva e informativa. Para lograrlo, utilicé colores neutros basados en los principios de la psicología del color y estructuré cuidadosamente el contenido para mejorar la legibilidad y el atractivo visual. Este enfoque garantiza que los usuarios encuentren la información accesible y visualmente agradable. Además, fue mi primera vez usando Figma, por lo cual no sabía muy bien qué herramientas tenía disponibles, pero lo solucioné viendo videos y aprendiendo con cursos en línea."
      }
